perf/jmeter/parameterized-http-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="ZetaGuard Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">Flexible HTTP Test - GET/POST with Body and Headers</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${__P(BASE_URL,http://localhost:9999)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="instance_path" elementType="Argument">
            <stringProp name="Argument.name">instance_path</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Instance Paths CSV" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">${__P(INSTANCE_PATHS_FILE,perf/jmeter/default-instance-paths.csv)}</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">${__P(INSTANCE_PATHS_SHARE_MODE,shareMode.all)}</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">instance_path</stringProp>
      </CSVDataSet>
      <hashTree/>
      <!-- WARMUP THREAD GROUP -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Warmup" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(WARMUP_THREADS,5)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(WARMUP_S,10)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Warmup Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Warmup Request" enabled="true">
          <stringProp name="HTTPSampler.path">${__P(BASE_URL,http://localhost:9999)}${instance_path}</stringProp>
          <stringProp name="HTTPSampler.method">${__P(HTTP_METHOD,GET)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Bind Instance Path" enabled="true">
            <stringProp name="cacheKey">bind-instance-path-warmup</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def mode = props.get('INSTANCE_PATH_BINDING_MODE')
if (mode != 'one_instance_per_thread') {
    return
}
def boundPath = vars.getObject('bound_instance_path')
if (boundPath == null) {
    def filePath = props.get('INSTANCE_PATHS_FILE')
    if (filePath == null || filePath.trim().isEmpty()) {
        throw new IllegalStateException('INSTANCE_PATHS_FILE missing for one_instance_per_thread binding')
    }
    def lines = java.nio.file.Files.readAllLines(
        java.nio.file.Path.of(filePath),
        java.nio.charset.StandardCharsets.UTF_8
    ).findAll { !it.trim().isEmpty() }
    int threadIndex = ctx.getThreadNum()
    if (threadIndex >= lines.size()) {
        throw new IllegalStateException("No instance path for thread index ${threadIndex + 1}; paths=${lines.size()}")
    }
    boundPath = lines.get(threadIndex)
    vars.putObject('bound_instance_path', boundPath)
}
vars.put('instance_path', boundPath as String)</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="hdr-trace" elementType="Header">
                <stringProp name="Header.name">X-Trace-Id</stringProp>
                <stringProp name="Header.value">${__UUID()}</stringProp>
              </elementProp>
              <elementProp name="content-type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">${__P(CONTENT_TYPE,)}</stringProp>
              </elementProp>
              <elementProp name="custom-header-1" elementType="Header">
                <stringProp name="Header.name">${__P(HEADER1_NAME,)}</stringProp>
                <stringProp name="Header.value">${__P(HEADER1_VALUE,)}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <!-- MAIN LOAD TEST -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,5)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP_S,5)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION_S,30)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
          <stringProp name="ConstantTimer.delay">${__P(THINK_MS,100)}</stringProp>
        </ConstantTimer>
        <hashTree/>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Jitter Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">${__P(JITTER_BASE_MS,0)}</stringProp>
          <stringProp name="RandomTimer.range">${__P(JITTER_RANGE_MS,0)}</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Throughput Timer" enabled="true">
          <intProp name="calcMode">4</intProp>
          <stringProp name="throughput">@@TARGET_SPM@@</stringProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ZetaGuard Request" enabled="true">
          <stringProp name="HTTPSampler.path">${__P(BASE_URL,http://localhost:9999)}${instance_path}</stringProp>
          <stringProp name="HTTPSampler.method">${__P(HTTP_METHOD,GET)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Bind Instance Path" enabled="true">
            <stringProp name="cacheKey">bind-instance-path-load</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def mode = props.get('INSTANCE_PATH_BINDING_MODE')
if (mode != 'one_instance_per_thread') {
    return
}
def boundPath = vars.getObject('bound_instance_path')
if (boundPath == null) {
    def filePath = props.get('INSTANCE_PATHS_FILE')
    if (filePath == null || filePath.trim().isEmpty()) {
        throw new IllegalStateException('INSTANCE_PATHS_FILE missing for one_instance_per_thread binding')
    }
    def lines = java.nio.file.Files.readAllLines(
        java.nio.file.Path.of(filePath),
        java.nio.charset.StandardCharsets.UTF_8
    ).findAll { !it.trim().isEmpty() }
    int threadIndex = ctx.getThreadNum()
    if (threadIndex >= lines.size()) {
        throw new IllegalStateException("No instance path for thread index ${threadIndex + 1}; paths=${lines.size()}")
    }
    boundPath = lines.get(threadIndex)
    vars.putObject('bound_instance_path', boundPath)
}
vars.put('instance_path', boundPath as String)</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="hdr-trace" elementType="Header">
                <stringProp name="Header.name">X-Trace-Id</stringProp>
                <stringProp name="Header.value">${__UUID()}</stringProp>
              </elementProp>
              <elementProp name="content-type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">${__P(CONTENT_TYPE,)}</stringProp>
              </elementProp>
              <elementProp name="custom-header-1" elementType="Header">
                <stringProp name="Header.name">${__P(HEADER1_NAME,)}</stringProp>
                <stringProp name="Header.value">${__P(HEADER1_VALUE,)}</stringProp>
              </elementProp>
              <elementProp name="custom-header-2" elementType="Header">
                <stringProp name="Header.name">${__P(HEADER2_NAME,)}</stringProp>
                <stringProp name="Header.value">${__P(HEADER2_VALUE,)}</stringProp>
              </elementProp>
              <elementProp name="custom-header-3" elementType="Header">
                <stringProp name="Header.name">${__P(HEADER3_NAME,)}</stringProp>
                <stringProp name="Header.value">${__P(HEADER3_VALUE,)}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code Check" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="expectedCode">${__P(EXPECTED_STATUS,200)}</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>